kein0r/CC2530Bee/main.c
/** @ingroup CC2530Bee
 * @{
 */
#include <ioCC2530.h>
#include <PlatformTypes.h>
#include <board.h>
#include <USART.h>
#include <IEEE_802.15.4.h>
#include <CC253x.h>
#include <string.h>
#include "CC2530Bee.h"

/**
 * \mainpage CC2530Bee
 * @brief CC2530 based implementation of famous XBee devices from Digi International Inc (see http://www.digi.com)
 *
 * The firmware for CC2530 was implemented to be able to use this chip as a drop-in replacement for the famous XBee devices together
 * with Arduino XBee library (see https://code.google.com/p/xbee-arduino/).
 * This implementation only supports "API Operation" using escape characters called "AP = 2: API Operation (with escaped characters)" in
 * XBee documentation. The reason is that this is the only mode supported by the Arduino library.
 * A simple python script is provided to test the functionality. Rx tests will only works with SmartRF Studio.
 * 
 * Implemented API Commands
 * ========================
 * - AT Command: API Identifier Value: 0x08. Partial, test for implemented parts exists. Not all AT commands are supported (see list below which)
 * - AT Command Response: API Identifier Value: 0x88. Fully implemented, test exists
 * - TX (Transmit) Request: 64-bit address: API Identifier Value: 0x00. Fully implemented, test exists
 * - TX (Transmit) Request: 16-bit address: API Identifier Value: 0x01. Fully implemented, test exists
 * - TX (Transmit) Status: API Identifier Value: 0x89. Fully implemented, test exists (not all return values can be tested)
 * - RX (Receive) Packet: 64-bit Address: API Identifier Value: 0x80. Fully implemented, test exists
 * - RX (Receive) Packet: 16-bit Address: API Identifier Value: 0x81. Fully implemented, test exists

 * Functionality missing:
 * ========================
 * - AT Command - Queue Parameter Value: API Identifier Value: 0x09
 * - Remote AT Command Request: API Identifier Value: 0x17
 * - Remote Command Response: API Identifier Value: 0x97
 * - All kind of nonvolatile storage of parametes 

 * Supported AT commands:
 * ========================
 * - Channel CH: 0x4848
 * - PanID ID: 0x4944
 * - Destination Address High DH: 0x4448
 * - Destination Address Low DL: 0x444c
 * - Source Address 16Bit MY: 0x 4d59
 * - Serialnumber High SH: 0x5348
 * - Serialnumber Low SL: 0x534c
*/

/**
  * General configuration struct
*/
CC2530Bee_Config_t CC2530Bee_Config;

/**
  * For each frame that is sent or received a buffer must be allocated before
  * sending or receiving.
  * For this a message element (struct, array etc.) must be declared and allocated
  * to which the payload pointer of the IEEE802154_header_t will point.
  */
IEEE802154_DataFrameHeader_t  IEEE802154_TxDataFrame;
IEEE802154_DataFrameHeader_t  IEEE802154_RxDataFrame;
IEEE802154_Payload radioRxPayload[100];

APIFrame_t rxAPIFrame;
APIFramePayload_t uartRxPayload[100];
APIFrame_t txAPIFrame;
APIFramePayload_t uartTxPayload[100];

void main( void )
{
  uint16_t atCommand;
  IEEE802154_PANIdentifier_t tempPanID;
  uint8_t UART_rxLength = 0;
  uint8_t led_status = 0;
  sleepTimer_t sleepTime;
  Board_init(); /* calls CC253x_Init */
  /*P0DIR_0 = HAL_PINOUTPUT;
  P0DIR_2 = HAL_PINOUTPUT;
  P0DIR_3 = HAL_PINOUTPUT;
  P0DIR_4 = HAL_PINOUTPUT;*/
  P0DIR_4 = HAL_PININPUT;
  P0DIR_5 = HAL_PININPUT;
  
  CC2530Bee_loadConfig(&CC2530Bee_Config);
  ledInit();
  
  /* Prepare rx and tx UART frames */
  rxAPIFrame.data = uartRxPayload;
  txAPIFrame.data = uartTxPayload;
  UART_init();
  USART_setBaudrate(CC2530Bee_Config.USART_Baudrate);
  USART_setParity(CC2530Bee_Config.USART_Parity);
  
  /* Prepare rx buffer for IEEE 802.15.4 */
  IEEE802154_RxDataFrame.payload = radioRxPayload;
  IEEE802154_radioInit(&(CC2530Bee_Config.IEEE802154_config));
  /* Tx source address is preloaded with chip's own 64bit address. Check if it should be used. */
  if (IEEE802154_TxDataFrame.sourceAddress.shortAddress == CC2530BEE_USE_64BIT_ADDRESSING)
  {
    IEEE802154_TxDataFrame.fcf.sourceAddressMode = IEEE802154_FCF_ADDRESS_MODE_64BIT;
  }
  else {
    IEEE802154_TxDataFrame.fcf.sourceAddressMode = IEEE802154_FCF_ADDRESS_MODE_16BIT;
  }
  enableAllInterrupt();
  
  sleepTime.value = 0xffff;
  
  /* now everyhting is set-up, start main loop now */
  while(1)
  {
    /* if enough bytes in Rx buffer parse it */
    if (USART_numBytesInRxBuffer() >= sizeof(APIFrameHeader_t))
    {
      /* receive header via UART and convert length to little-endian */
      USART_read((char *)&(rxAPIFrame.header), sizeof(APIFrameHeader_t));
      /* received data is big-endian, mcu is little endian */
      SWAP_UINT16(rxAPIFrame.header.length);
      /* @todo Check for frame length to be maximum of buffer */
      /* only proceed if CRC was ok */
      if ((rxAPIFrame.header.delimiter == UARTFrame_Delimiter) && UARTAPI_receiveFrame(&rxAPIFrame) == UARTFrame_CRC_OK)
      {
        switch (rxAPIFrame.data[0])
          {
            case UARTAPI_ATCOMMAND:
              if (rxAPIFrame.header.length == UARTAPI_ATCOMMAND_READ_LENGTH)
              {
                UARTAPI_readParameter(rxAPIFrame.data);
              }
              else {
                UARTAPI_setParameter(rxAPIFrame.data);
              }
              break;
            case UARTAPI_ATCOMMAND_QUEUE:
              break;
            case UARTAPI_REMOTE_AT_COMMAND_REQUEST:
              USART_writeline("Option 01 selected");
              break;
            case UARTAPI_TRAMSMIT_REQUEST_64BIT:
              IEEE802154_TxDataFrame.sequenceNumber = rxAPIFrame.data[UARTAPI_64BITTRANSMIT_FRAMEID];
              memcpy(&(IEEE802154_TxDataFrame.destinationAddress.extendedAdress), &(rxAPIFrame.data[UARTAPI_64BITTRANSMIT_ADDRESS]), sizeof(IEEE802154_ExtendedAddress_t) );
              /* save PAN ID in temporary variable in case it needs to be altered for this transmission */
              tempPanID = IEEE802154_TxDataFrame.destinationPANID;
              if (rxAPIFrame.data[UARTAPI_64BITTRANSMIT_OPTIONS] & UARTAPI_TRANSMIT_OPTIONS_DISABLEACK) {
                IEEE802154_TxDataFrame.fcf.ackRequired = 0;
              }
              if (rxAPIFrame.data[UARTAPI_64BITTRANSMIT_OPTIONS] & UARTAPI_TRANSMIT_OPTIONS_BROADCASTPANID) {
                IEEE802154_TxDataFrame.destinationPANID = IEEE802154_BROADCAST_PAN_ID;
              }
              /* set correct address mode in fcf for destination address. The corresponding bit for source address will 
               * be set whenever source address is changed */
              IEEE802154_TxDataFrame.fcf.destinationAddressMode = IEEE802154_FCF_ADDRESS_MODE_64BIT;
              /* point IEEE802154 payload pointer to data received via UART */
              IEEE802154_TxDataFrame.payload = &(rxAPIFrame.data[UARTAPI_64BITTRANSMIT_DATA]);
              IEEE802154_radioSentDataFrame(&(IEEE802154_TxDataFrame), rxAPIFrame.header.length - UARTAPI_64BITTRANSMIT_DATA);
              /* reset values back to "normal" which might have been changed above */
              IEEE802154_TxDataFrame.destinationPANID = tempPanID;
              IEEE802154_TxDataFrame.fcf.ackRequired = 1;
              break;
            case UARTAPI_TRAMSMIT_REQUEST_16BIT:
              IEEE802154_TxDataFrame.sequenceNumber = rxAPIFrame.data[UARTAPI_16BITTRANSMIT_FRAMEID];
              IEEE802154_TxDataFrame.destinationAddress.shortAddress = *((IEEE802154_ShortAddress_t*)&rxAPIFrame.data[UARTAPI_16BITTRANSMIT_ADDRESS]);
              /* save PAN ID in temporary variable in case it needs to be altered for this transmission */
              tempPanID = IEEE802154_TxDataFrame.destinationPANID;
              if (rxAPIFrame.data[UARTAPI_16BITTRANSMIT_OPTIONS] & UARTAPI_TRANSMIT_OPTIONS_DISABLEACK) {
                IEEE802154_TxDataFrame.fcf.ackRequired = 0;
              }
              if (rxAPIFrame.data[UARTAPI_16BITTRANSMIT_OPTIONS] & UARTAPI_TRANSMIT_OPTIONS_BROADCASTPANID) {
                IEEE802154_TxDataFrame.destinationPANID = IEEE802154_BROADCAST_PAN_ID;
              }
              /* set correct address mode in fcf for destination address. The corresponding bit for source address will 
               * be set whenever source address is changed */
              IEEE802154_TxDataFrame.fcf.destinationAddressMode = IEEE802154_FCF_ADDRESS_MODE_16BIT;
              /* point IEEE802154 payload pointer to data received via UART */
              IEEE802154_TxDataFrame.payload = &(rxAPIFrame.data[UARTAPI_16BITTRANSMIT_DATA]);
              IEEE802154_radioSentDataFrame(&(IEEE802154_TxDataFrame), rxAPIFrame.header.length - UARTAPI_16BITTRANSMIT_DATA);
              /* reset values back to "normal" which might have been changed above */
              IEEE802154_TxDataFrame.destinationPANID = tempPanID;
              IEEE802154_TxDataFrame.fcf.ackRequired = 1;
              break;
            case UARTAPI_ECHOTEST:
              /* Service only implemented for USART testing 
               * Will sent every valid frame back exactly as it was received */
              UARTAPI_sentFrame(uartRxPayload, rxAPIFrame.header.length);
              break;
            /* no default as the frame will be silently discarded */
          }
      }
      else {
        USART_writeline("ERROR (CRC)");
      }
      led_status = ~led_status;
    }
    else {
      /* noting */
    }
    /* ledOn();
    IEEE802154_radioSentDataFrame(&sentFrameOne, sizeof(sensorInformation_t));
    ledOff();
    CC253x_IncrementSleepTimer(sleepTime);
    CC253x_ActivatePowerMode(SLEEPCMD_MODE_PM2);*/
  }  // while(1)
}

/**
 * Load config from EEPROM. If invalid CRC found default config is loaded
 * @param config Pointer to configuration struct in which to store the configuration read from EEPROM
 * @todo Implement EEPROM stuff
 */
void CC2530Bee_loadConfig(CC2530Bee_Config_t *config)
{
  config->USART_Baudrate = USART_Baudrate_57600;
  config->USART_Parity = USART_Parity_8BitNoParity;
  
